ofml3_RL_case/rayleigh_benard/physics-simulation-engine/fluid-openfoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "20000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
16200
(
(0.000175576 -4.50795e-06 0)
(0.000341155 -4.34461e-06 0)
(0.000499136 -4.08131e-06 0)
(0.000646146 -3.72982e-06 0)
(0.000779241 -3.30394e-06 0)
(0.000895993 -2.82025e-06 0)
(0.000994552 -2.29635e-06 0)
(0.00107369 -1.7503e-06 0)
...
)
;

boundaryField
{
    floor
    {
        type            noSlip;
    }
    ceiling
    {
        type            noSlip;
    }
    leftWall
    {
        type            cyclic;
    }
    rightWall
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
