ofml3_RL_case/rayleigh_benard/physics-simulation-engine/fluid-openfoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "20000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
16200
(
0
-3.19126e-05
-8.33636e-05
-0.000152561
-0.000237165
-0.000334403
-0.000441224
-0.000554451
...
)
;

boundaryField
{
    floor
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
0.0282694
0.0282375
0.028186
0.0281168
0.0280322
0.027935
0.0278281
0.0277149
...
)
;
    }
    ceiling
    {
        type            calculated;
        value           nonuniform List<scalar> 
180
(
-19.9634
-19.9634
-19.9634
-19.9634
-19.9634
-19.9634
-19.9634
-19.9634
...
)
;
    }
    leftWall
    {
        type            cyclic;
    }
    rightWall
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
