ofml3_RL_case/rayleigh_benard/physics-simulation-engine/fluid-openfoam/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "20000";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
16200
(
0.0282694
0.0282375
0.028186
0.0281168
0.0280322
0.027935
0.0278281
0.0277149
...
)
;

boundaryField
{
    floor
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
180
(
0.0282694
0.0282375
0.028186
0.0281168
0.0280322
0.027935
0.0278281
0.0277149
...
)
;
    }
    ceiling
    {
        type            fixedFluxPressure;
        gradient        nonuniform List<scalar> 
180
(
0.0152637
0.016114
0.0174454
0.0191668
0.0211776
0.0233836
0.0257081
0.0280953
...
)
;
        value           nonuniform List<scalar> 
180
(
0.0365605
0.036563
0.0365671
0.0365732
0.0365815
0.0365926
0.0366073
0.0366265
...
)
;
    }
    leftWall
    {
        type            cyclic;
    }
    rightWall
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
