ofml3_RL_case/rayleigh_benard/physics-simulation-engine/fluid-openfoam/system/preCICE_Adapter
// -*- C++ -*-

type preciceAdapterFunctionObject;
libs ("libpreciceAdapterFunctionObject.so");


// ************************************************************************* //