ofml3_RL_case/rayleigh_benard/physics-simulation-engine/fluid-openfoam/system/preciceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2112
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../../precice-config.xml";

participant Fluid;

modules (CHT);

interfaces
{
  Interface
  {
    mesh              Fluid-Mesh;
    locations         faceCenters;
    patches           (floor);
    
    readData
    (
      Temperature
    );
    
    writeData
    (
      Heat-Flux
    );
  };
};

CHT
{
   Pr   0.7;
   rho rho [ 1  -3 0 0 0 0 0 ] 1.18;
   Cp Cp [ 0  2 -2 -1 0 0 0 ] 1.0063;
   solverType "incompressible";
};

// ************************************************************************* //